In [2]:
pip install pandas

Requirement already satisfied: pandas in c:\users\hp\desktop\text-summarization\textsummarization-nlp\texts\lib\site-packages (2.1.3)
Requirement already satisfied: numpy<2,>=1.23.2 in c:\users\hp\desktop\text-summarization\textsummarization-nlp\texts\lib\site-packages (from pandas) (1.26.2)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\hp\desktop\text-summarization\textsummarization-nlp\texts\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\hp\desktop\text-summarization\textsummarization-nlp\texts\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\users\hp\desktop\text-summarization\textsummarization-nlp\texts\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\hp\desktop\text-summarization\textsummarization-nlp\texts\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 23.1.2 -> 24.1.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [3]:
import pandas as pd

In [4]:
data=[10,20,30,40]
series = pd.Series(data)
series

0    10
1    20
2    30
3    40
dtype: int64

In [5]:
data=[10,20,30,40]
customIndex =['A','B','C','D']
series= pd.Series(data, index=customIndex)
series

A    10
B    20
C    30
D    40
dtype: int64

In [6]:
series['B']
series[1]

C:\Users\hp\AppData\Local\Temp\ipykernel_7984\1963945134.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  series[1]

20

In [7]:
result=series+4
result

A    14
B    24
C    34
D    44
dtype: int64

In [8]:
#Dataframs
data ={
    'Name':['A','B','V','F'],
    'age':[10,8,23,8],
    'city':['Aff','Afcani','Sri','Wolf']
    
}

In [9]:
df=pd.DataFrame(data)
df

  Name  age    city
0    A   10     Aff
1    B    8  Afcani
2    V   23     Sri
3    F    8    Wolf

In [10]:
df['Name']

0    A
1    B
2    V
3    F
Name: Name, dtype: object

In [11]:
df.loc[0]

Name      A
age      10
city    Aff
Name: 0, dtype: object

In [14]:
df =pd.read_csv('E:\Download\MechineLearning\salaries.csv')
df

       company                  job     degree  salary_more_then_100k
0       google      sales executive  bachelors                      0
1       google      sales executive    masters                      0
2       google     business manager  bachelors                      1
3       google     business manager    masters                      1
4       google  computer programmer  bachelors                      0
5       google  computer programmer    masters                      1
6   abc pharma      sales executive    masters                      0
7   abc pharma  computer programmer  bachelors                      0
8   abc pharma     business manager  bachelors                      0
9   abc pharma     business manager    masters                      1
10    facebook      sales executive  bachelors                      1
11    facebook      sales executive    masters                      1
12    facebook     business manager  bachelors                      1
13    facebook     business manager    masters                      1
14    facebook  computer programmer  bachelors                      1
15    facebook  computer programmer    masters                      1

In [15]:
df.head()

  company                  job     degree  salary_more_then_100k
0  google      sales executive  bachelors                      0
1  google      sales executive    masters                      0
2  google     business manager  bachelors                      1
3  google     business manager    masters                      1
4  google  computer programmer  bachelors                      0

In [16]:
pd.options.display.max_rows=100

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16 entries, 0 to 15
Data columns (total 4 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   company                16 non-null     object
 1   job                    16 non-null     object
 2   degree                 16 non-null     object
 3   salary_more_then_100k  16 non-null     int64
dtypes: int64(1), object(3)
memory usage: 644.0+ bytes

In [18]:
df.describe()

       salary_more_then_100k
count                 16.000
mean                   0.625
std                    0.500
min                    0.000
25%                    0.000
50%                    1.000
75%                    1.000
max                    1.000

In [19]:
df.shape

(16, 4)

In [20]:
df.isna().sum()

company                  0
job                      0
degree                   0
salary_more_then_100k    0
dtype: int64

In [ ]:
#df.dropna()
#df.fillna(20, inplace=true)
#df['job'].fillna(20,inplace=True)

In [ ]:
# x=df['job'].mean()
# df['job'].fillna(x,inplace=True)
#x=df['job'].mode()[0]
#df.drop_duplicates(inplace=True)
#df.rename(columns={'company':'companyName'}, inplace=True)
# df['gender'] = ['yes','No','yes','yes',no]
# df
# grouped_df = df.groupby('Gender')['Age'].mean()
# grouped_df

In [22]:
# df.corr()

In [ ]:
# df.plot(kind='bar', x='salary',y='age' )
#only valid for numeric

In [23]:
import matplotlib.pyplot as plt

In [ ]:
# df.plot(kind='bar', x='salary',y='age', color='red' )
# plt.xlabel('salary')
# plt.ylabel('age')
# plt.title('scatter plot')
# plt.show()